Repository: jahoroshi/TelegramLearningBot
Catalog: app/locales/*/LC_MESSAGES/messages.po
Languages: ru

# greeting
source: Hi there! Great to see you! I'm your multilingual assistant!
ru: Привет! Рад вас видеть! Это ваш многоязычный помощник!

# decks
source: My Decks
ru: Категории

# greeting_after_creating_test_deck
source: 👋 | WELCOME 🎁 We’ve created a test deck for you to explore all the features of our app. 🤓 Once you’re familiar with it, feel free to delete it and create your own unique decks. <tg-spoiler>🫶 Good luck!</tg-spoiler> <tg-spoiler>😎👌🔥</tg-spoiler>
ru: 👋 | WELCOME 🎁 Мы сделали для вас тестовую категорию, чтобы вы могли познакомиться со всеми возможностями нашего приложения. 🤓 Когда освоитесь, можете удалить её и создать свои собственные уникальные категории. <tg-spoiler>🫶 Удачи вам!</tg-spoiler> <tg-spoiler>😎👌🔥</tg-spoiler>

# create_deck_ddn
source: Create a New Deck
ru: Создать новую категорию

# study_format_en
source: How would you like to study the cards: by listening or reading?
ru: Как вы хотите изучать карточки: слушая или читая?

# study_format_audio_en
source: Listening
ru: Слушать

# study_format_text_en
source: Reading
ru: Читать

# tip_message_1
source: If you want to create a new deck, access settings, or restart the bot, just hit the 'Menu' button below this message. ⤵️
ru: Если хотите создать новую категорию, заглянуть в настройки или перезапустить бота, нажмите на кнопку "Меню" под этим сообщением. ⤵️

# help_description
source: <b><i>Add Cards Easily and Quickly!</i></b> 🌟 Hi there! 😊 We’ve made adding cards super simple. You can now instantly add a <b>word</b> or <b>phrase</b> from any app or browser. Just highlight the text, tap 'Share' 📤, and choose Telegram to send it to our <b>AnkiBot</b> 🤖. ✍ In the '<b>Add a comment</b>' field, you can specify what will be on the back of the card, or leave it blank to fill it in later in the <b>chat</b>. 🧩 Once AnkiBot receives both messages, it will know you want to create a new <b>card</b> and will prompt you to select an appropriate <b>deck</b> 🗂️. It’s all <b>simple</b> and <b>convenient</b>! Good luck! ✨
ru: <b><i>Добавляйте карточки легко и быстро!</i></b> 🌟 Привет! 😊 Мы сделали процесс добавления карточек проще простого. Теперь вы можете мгновенно добавить <b>слово</b> или <b>фразу</b> из любого приложения или браузера. Просто выделите текст, нажмите «Поделиться» 📤 и выберите Телеграм, чтобы отправить нашему <b>АнкиБоту</b> 🤖. ✍ В поле «<b>Добавить комментарий</b>» вы можете указать, что будет на обратной стороне карточки, или оставить его пустым и заполнить позже в <b>чате</b>. 🧩 Как только AnkiBot получит оба сообщения, он поймет, что вы хотите создать новую <b>карточку</b>, и предложит выбрать подходящую <b>категорию</b> 🗂️. Всё <b>просто</b> и <b>удобно</b>! Удачи вам! ✨

# refresh_command
source: REFRESH
ru: ОБНОВИТЬ

# enter_front_side
source: ☝️ Enter the text for the front side <blockquote>Or tap <b>back</b> to cancel</blockquote>
ru: ☝️ Введите текст лицевой стороны <blockquote>Или нажмите <b>назад</b> для отмены</blockquote>

# enter_card_number_edit
source: 🔢 Enter the card number from the list to edit it:
ru: 🔢 Введите номер карточки из списка, чтобы её изменить:

# enter_card_number_delete
source: 🔢 Enter one card number or multiple numbers from the list to delete:
ru: 🔢 Введите номер одной карточки или несколько номеров из списка, чтобы удалить:

# max_50_chars
source: ❕️ The message should not exceed 50 characters.
ru: ❕️ Сообщение не должно превышать 50 символов.

# please_try_again
source: ❗️ Please try again, you can do it!
ru: ❗️ Попробуйте снова, у вас получится!

# index_must_be_in_list
source: ❗️ The number must be in the card list. Please try again.
ru: ❗️ Номер должен быть в списке карточек. Попробуйте ещё раз.

# successfully_deleted_cards
source: 💣 Cards successfully deleted {0}
ru: 💣 Карточек успешно удалено: {0} !

# something_went_wrong
source: ❗️ Something went wrong. Let's try again.
ru: ❗️ Что-то пошло не так. Давайте попробуем снова.

# index_must_be_digit
source: ️️❕️ The number must be a single digit. Please try again.
ru: ️️❕️ Номер должен быть одной цифрой. Попробуйте снова.

# please_try_again_emoji
source: 🧸 Please try again, you got this!
ru: 🧸 Попробуйте снова, вы сможете!

# enter_front_side_no_emoji
source: Enter the text for the front side:
ru: Введите текст на лицевой стороне:

# max_255_chars
source: ⛔️ Maximum text length is 255 characters.
ru: ⛔️ Максимальная длина текста — 255 символов.

# side_must_contain_alnum
source: ⛔️ The side must contain at least one letter or number.
ru: ⛔️ Сторона должна содержать хотя бы одну букву или цифру.

# enter_back_side
source: ✌️ Enter the text for the back side
ru: ✌️ Введите текст для обратной стороны

# study_two_sides
source: Do you want to study both sides of the card?
ru: Хотите изучать обе стороны карточки?

# card_created
source: Card successfully created!
ru: Карточка успешно создана!

# card_updated
source: Card successfully updated! 🎉
ru: Карточка успешно обновлена! 🎉

# choose_deck
source: Choose a deck from the list below:
ru: Выберите категорию из списка ниже:

# oops_something_went_wrong
source: 🤯🥳 Oops, something went wrong. Please press the REFRESH button or try again later.
ru: 🤯🥳 Ой, что-то пошло не так. Пожалуйста, нажмите кнопку ОБНОВИТЬ или попробуйте снова чуть позже.

# import_instruction
source: 🔔 <b>How to Import:</b> » The maximum message length is 4096 characters. » Use a semicolon <b> ; </b> as a separator between sides. » Each card should be on a new line. <b>Example:</b> <blockquote>(<i>side 1</i>) <b>;</b> (<i>side 2</i>) Apple <b>;</b> Яблоко Orange <b>;</b> Апельсин</blockquote> <i>enter text or press back to cancel</i>
ru: 🔔 <b>Как импортировать:</b> » Максимальная длина сообщения 4096 символов. » Используйте точку с запятой <b> ; </b> как разделитель между сторонами » Каждая карточка должна быть на новой строке. <b>Пример:</b> <blockquote>(<i>сторона 1</i>) <b>;</b> (<i>сторона 2</i>) Apple <b>;</b> Яблоко Orange <b>;</b> Апельсин</blockquote> <i>введите текст или нажмите назад для отмены</i>

# deck_empty
source: There are no cards in this deck yet. 🗂️ You can add them by clicking the “Add” button. ➕ You can also send cards directly to the AnkiBot: 1️⃣ Send two separate messages — in the first message, enter the text for the front side of the card, 2️⃣ and in the second, enter the text for the back side. ✍️
ru: В этой категории пока нет карточек. 🗂️ Вы можете добавить их, нажав на кнопку «Добавить». ➕ Вы также можете отправить карточки сразу АнкиБоту: 1️⃣ Отправьте два разных сообщения — в первом напишите текст для первой стороны карточки, 2️⃣ а во втором — для второй. ✍️

# show_letters_button
source: Show {0} letters
ru: Показать {0} буквы

# incorrect_try_again
source: 🤯🥳 Incorrect. Try again, you can do it!
ru: 🤯🥳 Неправильно. Попробуйте ещё раз, у вас всё получится!

# similar_words_not_found
source: 🤯🥳 No similar words found. Please try again.
ru: 🤯🥳 Похожие слова не найдены. Попробуйте снова.

# correct_message
source: 🎉 Great, that's correct!
ru: 🎉 Отлично, правильно!

# correct_answer
source: 🚨 Correct Answer: <i><b>{0}</b></i>
ru: 🚨 Правильный ответ: <i><b>{0}</b></i>

source: Again
ru: Трудно

source: Hard
ru: Лучше

source: Good
ru: Хорошо

source: Easy
ru: Легко

# try_again_error
source: Something went wrong, please try again.
ru: Что-то пошло не так, попробуйте снова.

# let's_begin
source: Let's get started!
ru: Давайте начнём!

# show_back_hint
source: Tap <i><b>Show Back</b></i> or choose a hint
ru: Нажмите <b>Показать ответ</b> или выберите подсказку

source: studied
ru: изучили

source: reviewed
ru: повторили

source: 🎊 Congratulations! 🎊
ru: 🎊 Поздравляем вас! 🎊

# all_cards_studied
source: You’ve {0} all your cards for today. You can study another deck or wait for the next session.
ru: Вы {0} все свои карточки на сегодня. Можете изучить другую категорию или подождать, когда карточки станут доступны для повторения.

# already_announced
source: The card has already been shown.
ru: Карточка уже была показана.

# text_to_speech_error
source: There was a problem with text-to-speech. Let's try again.
ru: Проблема с преобразованием текста в речь. Давайте попробуем ещё раз.

# study_format
source: Choose how you'd like to study:
ru: Выберите, как вы хотите учить:

source: Study all decks
ru: Учить все новые карточки

source: Review all decks
ru: Повторить все карточки

# create_deck
source: Create a deck
ru: Создать категорию

# enter_deck_name
source: Enter the name for the new deck:
ru: Введите название новой категории:

# deck_created_successfully
source: 🎉 Yay! Deck created successfully.
ru: 🎉 Ура! Категория успешно создана.

source: « Back to Decks List
ru: « На главную

# choose_deck_from_list
source: Choose a deck from the list below:
ru: Выберите категорию из списка ниже:

# deck_title
source: Decks
ru: Мои категории

# decks_empty_create_new
source: No decks yet. Create a new deck!
ru: Категории пока пусты. Создайте новую категорию!

# error_occurred_contact_support
source: 🤯🥳 Oops, something went wrong. If the issue persists, please contact our support at ankichat.com.
ru: 🤯🥳 Возникли неполадки. Если они не исчезают, напишите нам в поддержку на ankichat.com.

# oops_try_again
source: 🤯🥳 Oops, something went wrong. Please press the REFRESH button or try again later.
ru: 🤯🥳 Ой, что-то пошло не так. Пожалуйста, нажмите кнопку ОБНОВИТЬ или попробуйте позже.

# confirm_delete_deck
source: Are you sure you want to delete this deck?
ru: Вы уверены, что хотите удалить эту категорию?

# deck_deleted
source: 🧨 Deck deleted successfully.
ru: 🧨 Категория успешно удалена.

# enter_new_deck_name
source: <b><i>Enter a new deck name</i></b> Or press <i>back</i> to cancel
ru: <b><i>Введите новое название категории</i></b> Или нажмите <i>назад</i> для отмены

# max_100_chars
source: ❕️ The new name should be a maximum of 100 characters.
ru: ❕️ Новое имя должно содержать максимум 100 символов.

# deck_name_changed
source: ᝰ.ᐟ Deck name changed successfully.
ru: ᝰ.ᐟ Название категории успешно изменено.

# name_letters_numbers
source: The name should consist of letters or numbers. Please try again.
ru: Имя должно состоять из букв или цифр. Попробуйте снова.

# reset_progress_confirmation
source: ♻️ Resetting your progress will erase all study data and reset all cards in this deck to their original state. Cards will not be deleted from the deck. The reset affects only the current deck. ❓ Do you want to continue?
ru: ♻️ Сброс прогресса удалит все данные изучения и вернет все карточки в этой категории в их начальное состояние. Карточки не будут удалены из категории. Сброс затрагивает только текущую категорию. ❓ Хотите продолжить?

# deck_reset_success
source: ♻️ Deck successfully reset. ♻️ _
ru: ♻️ Категория успешно сброшена. ♻️ _

# deck_is_empty
source: The deck is empty.
ru: Категория пуста.

source: Add Card
ru: Добавить

source: Edit Card
ru: Редактировать

source: Delete Card
ru: Удалить

source: « Back to Deck
ru: « Назад

source: Yes
ru: Да

source: No
ru: Нет

source: Add Another Card
ru: Добавить ещё одну карточку

source: Select Recall Level
ru: Выберите, на сколько было сложно

# show_back
source: Show Answer
ru: Показать ответ

# ask_for_hint
source: Ask ChatGPT
ru: Спросить ChatGPT

# show_similar_words
source: Similar Words
ru: Похожие слова

# show_first_letters
source: First Letters
ru: Первые буквы

source: Scramble Letters
ru: Перемешать буквы

# finish_training
source: 「」Finish
ru: 「」Выйти

source: 😎 Already Known
ru: 😎 Уже знаю

# study_new
source: Study New Cards
ru: Учить новые карточки

source: Review Cards
ru: Повторить карточки

source: Show Cards
ru: Карточки

# import_cards
source: Import
ru: Импортировать

# deck_manage
source: Manage Deck
ru: Настройки

source: « Back to Decks
ru: « На главную

# rename_deck
source: ✎ Rename
ru: ✎ Переименовать категорию

# delete_deck
source: × Delete
ru: × Удалить категорию

source: ↻ Reset Progress
ru: ↻ Сбросить прогресс категории

# back_to_deck_manage
source: « Go Back
ru: « Назад

source: Delete
ru: Удалить

source: Back
ru: « Назад

source: Manage
ru: Управление

# create_new_deck
source: Create Deck
ru: Создать категорию

# study_format_text
source: Text
ru: Текст

# study_format_audio
source: Audio
ru: Аудио

source: REFRESH
ru: ОБНОВИТЬ

# next_review
source: ⏰ Next review in {0} h.
ru: ⏰ Следующее повторение будет через {0} ч.

source: Card will be available:
ru: Карточка будет доступна:

# deck_details_tip
source: Welcome to deck management. 🤓 To start studying cards, press <b>'Study'</b>. 🧐 The <b>'Show Cards'</b> button will show all the cards in this deck. 🚚 To add multiple cards at once, use the <b>'Import'</b> button.
ru: Добро пожаловать в управление категорией. 🤓 Чтобы начать учить карточки, нажмите <b>«Учить»</b>. 🧐 Кнопка <b>«Смотреть карточки»</b> покажет все карточки в этой категории. 🚚 Чтобы добавить сразу много карточек, используйте кнопку <b>«Импортировать»</b>.

# show_cards_tip
source: This is the card management menu. Press <b>'Add Card'</b> to add a new card. The <b>'Edit Card'</b> button allows you to change the selected card. To delete a card, press <b>'Delete Card'</b>.
ru: Это меню управления карточками. Нажмите <b>«Добавить карточку»</b>, чтобы добавить новую. Кнопка <b>«Редактировать карточку»</b> позволит изменить выбранную карточку. Чтобы удалить карточку, нажмите <b>«Удалить карточку»</b>.

# delete_card_tip
source: To delete a single card, enter its number from the list. To delete multiple cards, list their numbers separated by spaces or commas.
ru: Чтобы удалить одну карточку, введите её номер из списка. Чтобы удалить несколько, перечислите их номера через пробел или запятую.

# add_card_tip_1
source: Adding a card is now easier than ever. Just send me two messages: 1. The first is the text you want on the <b>front side</b> of the card. 📝 2. The second is the text for the <b>back side</b>. ✨ Once I receive both messages, I'll understand that you want to add a card and suggest a suitable <b>deck</b>. It’s all <b>simple</b> and <b>fast</b>! If you have any questions, feel free to ask. Good luck! 😊 <i>I'm waiting for your first message for the front side of the card!</i> ↴
ru: Добавить карточку стало проще простого. Просто отправьте мне два сообщения: 1. Первое — это текст, который будет на <b>лицевой стороне</b> карточки. 📝 2. Второе — текст для <b>обратной стороны</b>. ✨ Как только я получу оба сообщения, я пойму, что вы хотите добавить карточку, и предложу выбрать подходящую <b>категорию</b>. Всё <b>просто</b> и <b>быстро</b>! Если есть вопросы, не стесняйтесь спрашивать. Удачи вам! 😊 <i>Я жду ваше первое сообщение для лицевой стороны карточки!</i> ↴

# add_card_tip_2
source: 🃏 First, enter the side of the card you want to study. It will be shown first during the study. 🎴 If you want to study both sides, specify this at the end of the card-adding process. 👇 And now enter the first side.
ru: 🃏 Сначала введите сторону карточки, которую хотите изучать. Она будет показываться первой во время изучения. 🎴 Если хотите учить обе стороны, укажите это в конце процесса добавления.

# edit_card_tip
source: How to edit a card: 1. Select a card by entering its number from the list. 2. Enter new text for the front and back sides. If you don’t want to change one of the sides, just write two dots ( .. ) . 3. Note: fields cannot be empty. Use three dots for unchanged sides. 4. After that, choose whether you want to study both sides of the card. Let's get started! Please enter the card number. ⤵️
ru: Как изменить карточку: 1. Выберите карточку, введя её номер из списка. 2. Введите новый текст для лицевой и обратной сторон. Если не хотите менять одну из сторон, просто напишите две точки ( .. ) . 3. Внимание: поля не могут быть пустыми. Используйте три точки для сторон без изменений. 4. После этого выберите, хотите ли изучать обе стороны карточки. Начинаем! Пожалуйста, введите номер карточки. ⤵️

# import_cards_tip
source: Here you can add multiple cards to the desired deck at once. Follow the instructions above, and you’ll do great. 🏆
ru: Здесь вы можете добавить сразу несколько карточек в нужную категорию. Следуйте инструкциям выше, и у вас всё получится. 🏆

# choose_study_format_tip
source: Choose how the front side of the card will be displayed. 🇦 If you choose text, it will be shown as text. 🗣️ If you choose sound, the front side will be voiced. This will help train auditory perception. 🏋️‍♂️
ru: Выберите, как будет показываться лицевая сторона карточки. 🇦 Если выберете текст, она будет в текстовом виде. 🗣️ Если выберете звук, лицевая сторона будет озвучиваться. Это поможет развивать восприятие на слух. 🏋️‍♂️

# start_studying_tip
source: This is the card study mode. 🧐 If you already know this card and don’t want to study it further, tap <b>'already known'</b> at the bottom. 👀 To see the back side of the card, tap <b>'Show Answer'</b>.
ru: Это режим изучения карточек. 🧐 Если вы уже знаете эту карточку и не хотите её дальше учить, нажмите <b>«уже знаю»</b> внизу. 👀 Чтобы увидеть обратную сторону карточки, нажмите <b>«Показать ответ»</b>.

# rating_tip_1
source: 👉 Tap <b>'Show Answer'</b> or use a hint, and then assess how easy it was to recall.
ru: 👉 Нажмите <b>«Показать ответ»</b> или используйте подсказку, а затем оцените, насколько легко было вспомнить.

# rating_tip_2
source: 🚧 If you can’t remember the card’s meaning, don’t rush to tap 'Show Answer'. 🚀 Try using one of our hints to help yourself a bit. 🥇 After that, assess how difficult it was to recall the answer.
ru: 🚧 Если не можете вспомнить значение карточки, не спешите нажимать «Показать ответ». 🚀 Попробуйте использовать одну из наших подсказок, чтобы помочь себе. 🥇 После этого оцените, насколько сложно было вспомнить ответ.

# addcard_command_tip
source: There’s another way to add a card faster! Just send the bot two messages: the first is the text on the front side of the card, and the second is the text on the back side. 📝✨ Once the bot receives both messages, it will know you want to add a card and suggest a suitable deck. It’s easy and quick! Good luck! 😊 <i>In the meantime, let's continue entering the front side of the card</i> ↴
ru: Есть другой способ добавить карточку быстрее! Просто отправьте боту два сообщения: первое — текст лицевой стороны карточки, второе — текст обратной стороны. 📝✨ Когда бот получит оба сообщения, он поймёт, что вы хотите добавить карточку, и предложит выбрать подходящую категорию. Это легко и быстро! Удачи! 😊 <i>А пока продолжим ввод лицевой стороны карточки</i> ↴

source: Tip!
ru: Совет!

source: Answer
ru: Ответ

# something_went_wrong_persistent_error
source: 🤯🥳 Something went wrong. If the problem persists, please contact our support at ankichat.com.
ru: 🤯🥳 Что-то пошло не так. Если проблема не исчезнет, свяжитесь с нашей поддержкой на ankichat.com.

# add_card_quick
source: Quickly Add Card
ru: Быстро добавить карточку

# refresh_bot
source: Refresh the Bot
ru: Обновить бота

# manage_account_settings
source: Settings
ru: Настройки

# get_help_information
source: Help and Information
ru: Помощь и информация

source: {days}d : {hours}h : {minutes} min
ru: {days} д : {hours} ч : {minutes} мин

source: {hours}h : {minutes}min
ru: {hours} ч : {minutes} мин

source: Next review will be in: {text}
ru: Следующее повторение будет через: {text}

source: Cards in deck
ru: Всего карточек

source: No cards in deck
ru: Карточек в категории нет

source: New cards for studying
ru: Не изученных карточек

# no_new_cards_for_studying
source: No cards for studying
ru: Нет новых карточек для изучения

source: Cards for review
ru: Карточек для повторения

source: No cards for review
ru: Нет карточек для повторения

# cards_imported_successfully
source: ⚜️ {0} cards imported successfully.
ru: ⚜️ Импортировано {0} карточек.

# import_cards_error
source: 🖐 You can't import because there are over 500 cards in the category. Try adding them one by one instead.
ru: 🖐 Импорт не разрешен, потому что в категории больше 500 карточек. Попробуй добавлять их по одной.

source: Reset
ru: Сбросить
